configuration/src/InformationRegisters/СохраненныеПорядкиЗаявок/СохраненныеПорядкиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СохраненныеПорядкиЗаявок</name>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаЗаказчиков</name>
    <type>
      <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОчередиОбъекта</name>
    <type>
      <types>CatalogRef.КлючОчереди</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СохраненныеПорядкиЗаявок/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет запись
//
// Параметры:
//  Заявка		 - ДокументСсылка.ЗаявкаНаРазработку - Заявка
//  КлючОчереди	 - СправочникСсылка.КлючОчереди		 - Ключ очереди
//  Порядок		 - Число							 - Порядок очереди
//
Процедура ДобавитьЗапись(Знач Заявка, Знач КлючОчереди, Знач Порядок) Экспорт
		
	ДатаДобавления = ТекущаяДата();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Отбор.КлючОчередиОбъекта.Установить(КлючОчереди);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Заявка = Заявка;
	НоваяЗапись.КлючОчередиОбъекта = КлючОчереди;	
	НоваяЗапись.Порядок = Порядок;
	НоваяЗапись.ДатаДобавления = ДатаДобавления;
	НоваяЗапись.Автор = Автор;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

#КонецОбласти
